<%@taglib prefix="t" tagdir="/WEB-INF/tags" %>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib uri = "http://java.sun.com/jsp/jstl/core" prefix = "c" %>
<%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt" %>
<t:page title="About">
    <h1><b>Про проект</b></h1>
    <div class="about-text"><img src="${pageContext.request.contextPath}/images/happy_student.jpg" width="40%" class="about-photo"/>
    <p>Програма <b>WebExam</b> призначена як для перевірки вмінь розв'язувати задачі, так і для вдосконалення отриманих знань, набутих вмінь і навичок. <b>WebExam</b> є унікальним проектом через поєднання в собі інтелектуальної роботи користувача (при усвідомленні питань та пошуці відповідей) та розробленої системи аналізу відповідей. <b>WebExam</b> призначений і для тих, хто хоче перевірити якість набутих знань та вмінь у навчальному процесі, і для тих, хто лише починає вивчати відповідні дисципліни, і для тих, хто хоче "помірятись силами" з іншими учасниками проекту.
        <br/>
        <strong>Перше і найголовніше правило - спочатку думати, а потім ... ще кілька раз подумати і лише після цього давати відповідь.</strong> Принцип простий - за правильні відповіді учасник отримує бали (залежно від складності задачі). Після проходження тесту результат заноситься в статистичну таблицю, доступ до якої мають адміністратор та викладачі. На основі цього результату викладач може оцінити рівень здобутих вмінь та навичок студента.</p>
        <br/> Не так давно про складання іспиту чи написання модульної контрольної роботи, сидячи перед комп'ютером у тебе вдома в комфортному оточенні з чашкою гарячого чаю можна було тільки мріяти. Тепер, завдяки <b>WebExam</b> це доступно кожному!
        <br/><br/><strong>І пам'ятайте - помилок не допускає лиш той, хто нічого не робить. Успіхів у навчанні!</strong>
    </div>
    <hr />
</t:page>
